package com.lunjar.ebp.bizsupport.enums;

/**
 * 异常编号与信息
 * 
 * @author <a href="mailto:xbd0723@163.com">LiXuan</a> 2016年8月18日上午11:28:50
 */
public enum BizSupportCode {

	/** 图片保存异常 */
	_2001001(2001001, "图片保存异常"),
	/** 商家id不能为空 */
	_2001002(2001002, "商家id不能为空"),
	/** 商品价格不能为空 */
	_2001003(2001003, "商品价格不能为空"),
	/** 商品销量不能为空 */
	_2001004(2001004, "商品销量不能为空"),
	/** 类目id不能为空 */
	_2001005(2001005, "类目id不能为空"),
	/** 类目名称不能为空 */
	_2001006(2001006, "类目名称不能为空"),
	/** 产品状态不能为空 */
	_2001007(2001007, "产品状态不能为空"),
	/** 产品总数不能为空 */
	_2001008(2001008, "产品总数不能为空"),
	/** 产品属性图片状态不为能空 */
	_2001009(2001009, "产品属性图片状态不为能空"),
	/** 产品属性图片状态不为能空 */
	_2001010(2001010, "产品属性图片排序不为能空"),
	/** 产品属性图片状态不为能空 */
	_2001011(2001011, "产品属性图片类型不为能空"),
	/** 产品销售价格不为能空 */
	_2001012(2001012, "产品销售价格不为能空"),
	/** 产品主图不为能空 */
	_2001013(2001013, "产品主图不为能空"),
	/** 自定义类目id不能为空 */
	_2001014(2001014, "自定义类目id不能为空"),
	/** 产品id不能为空 */
	_2001015(2001015, "商品id不能为空"),
	/** 商铺id不能为空 */
	_2001016(2001016, "商铺id不能为空"),
	/** 产品信息不存在 */
	_2001017(2001017, "产品信息不存在"),
	/** 购买用户id不能为空 */
	_2001018(2001018, "购买用户id不能为空"),
	/** 自定义类目名称不能为空 */
	_2001019(2001019, "自定义类目名称不能为空"),
	/** 商家或者商铺id不能为空 */
	_2001020(2001020, "商家或者商铺id不能为空"),
	/** 产品属性图片地址不为能空 */
	_2001021(2001021, "产品属性图片地址不为能空"),

	/** 订单id不为能空 */
	_2001022(2001022, "订单id不为能空"),
	/** 商品数量不为能空 */
	_2001023(2001023, "商品数量不为能空"),
	/** 订单实付价格不为能空 */
	_2001024(2001024, "订单实付价格不为能空"),
	/** 商品的类型不为能空 */
	_2001025(2001025, "商品的类型不为能空"),
	/** 自定义类目不存在 */
	_2001026(2001026, "自定义类目不存在"),

	/** 组合商品名称不能为空 */
	_2002000(20002000, "组合商品名称不能为空"),
	/** 组合商品主图路径不能为空 */
	_2002001(20002001, "组合商品主图路径不能为空"),
	/** 组合商品价格不能为空 */
	_2002002(20002002, "组合商品价格不能为空"),
	/** 商品1出售价格不能为空 */
	_2002003(2002003, "商品1出售价格不能为空"),
	/** 商品2出售价格不能为空 */
	_2002004(2002004, "商品2出售价格不能为空"),
	/** 商品3出售价格不能为空 */
	_2002005(2002005, "商品3出售价格不能为空"),
	/** 商品4出售价格不能为空 */
	_2002006(2002006, "商品4出售价格不能为空"),
	/** 商品5出售价格不能为空 */
	_2002007(2002007, "商品5出售价格不能为空"),
	/** 该商家没有快递模板 */
	_2002008(2002008, "该商家没有快递模板"),

	/** 卖家id不能为空 */
	_3000001(3000001, "卖家id不能为空"),
	/** 买家id不能为空 */
	_3000002(3000002, "买家id不能为空"),
	/** 收货者所在省份不能为空 */
	_3000003(3000003, "收货者所在省份不能为空"),
	/** 收货者所在城市不能为空 */
	_3000004(3000004, "收货者所在城市不能为空"),
	/** 是否开发票不能为空 */
	_3000005(3000005, "是否开发票不能为空"),
	/** 配送方式不能为空 */
	_3000006(3000006, "配送方式不能为空"),
	/** 商家信息不存在 */
	_3000007(3000007, "商家信息不存在"),
	/** 卖家信息不存在 */
	_3000008(3000008, "卖家信息不存在"),
	/** 商铺信息不存在 */
	_3000009(3000009, "商铺信息不存在"),
	/** 合作平台信息不存在 */
	_3000010(3000010, "合作平台信息不存在"),
	/** 买家地址id不能为空 */
	_3000011(3000011, "买家地址id不能为空"),
	/** 买家地址信息不存在 */
	_3000012(3000012, "买家地址信息不存在"),
	/** 订单总价格不能为空 */
	_3000013(3000013, "订单总价格不能为空"),
	/** 订单拥有者id不能为空 */
	_3000014(3000014, "订单拥有者id不能为空"),
	/** 订单拥有者类型不能为空 */
	_3000015(3000015, "订单拥有者类型不能为空"),
	/** 订单拥有者类型不存在 */
	_3000016(3000016, "订单拥有者类型不存在"),
	/** SKU信息不存在 */
	_3000017(3000017, "SKU信息不存在"),
	/** 商品数量不能小于1 */
	_3000018(3000018, "商品数量不能小于1"),
	/** 发票抬头不能为空 */
	_3000019(3000019, "发票抬头不能为空"),
	/** 自取地址id不能为空 */
	_3000020(3000020, "自取地址id不能为空"),
	/** 自取地点不存在 */
	_3000021(3000021, "自取地点不存在"),
	/** 收货人姓名不能为空 */
	_3000022(3000022, "收货人姓名不能为空"),
	/** 收货人手机号码不能为空 */
	_3000023(3000023, "收货人手机号码不能为空"),
	/** 购物车列表不能为空 */
	_3000024(3000024, "购物车列表不能为空"),
	/** 购物车信息不存在 */
	_3000025(3000025, "购物车信息不存在"),
	/** 发票类型不能为空 */
	_3000026(3000026, "发票类型不能为空"),
	/*** 订单信息为空 **/
	_3000027(3000027, "订单信息为空"),
	/*** 组合列表不能为空 **/
	_3000028(3000028, "组合列表不能为空"),
	/*** 组合商品不存在 **/
	_3000029(3000029, "组合商品不存在"),
	/*** 商品库存不足 **/
	_3000030(3000030, "商品库存不足"),
	
	/*** 总订单编号不能为空 **/
	_4000001(4000001, "总订单编号不能为空"),
	/*** 总的订单编号不能为空 **/
	_4000002(4000002, "总订单编号对象不能为空"),
	/*** 子订单id不能为空 **/
	_4000003(4000003, "子订单id不能为空"),
	/*** 商品提货时间不能为空 **/
	_4000004(4000004, "商品提货时间不能为空"),
	
	/*** 收货地址状态不能为空 **/
	_5000001(5000001, "收货地址状态不能为空"),
	/*** 收货地址是否默认不能为空 **/
	_5000002(5000002, "收货地址是否默认不能为空"),
	/*** 收货地址类型不能为空 **/
	_5000003(5000003, "收货地址类型不能为空"),
	/*** 收货地址区县不能为空 **/
	_5000004(5000004, "收货地址区县不能为空"),
	
	/*** 物流公司id不能为空 **/
	_6000001(6000001, "物流公司id不能为空"),
	/*** 物流公司不存在 **/
	_6000002(6000002, "物流公司不存在"),
	
	/** ParentCode不能为空 */
	_9000000(9000000, "ParentCode不能为空"),
	/** Code不能为空 */
	_9000001(9000001, "Code不能为空"),
	/** RootCode不能为空 */
	_9000002(9000002, "RootCode不能为空"),
	/** 地区级别不能为空 */
	_9000003(9000003, "地区级别不能为空"),;

	private int code;
	private String msg;

	private BizSupportCode(int code, String msg) {
		this.code = code;
		this.msg = msg;
	}

	public static BizSupportCode valueOf(int code) {
		BizSupportCode result = null;
		BizSupportCode[] ts = BizSupportCode.class.getEnumConstants();
		for (BizSupportCode aps : ts) {

			if (aps.getCode() == code) {
				result = aps;
				break;
			}
		}
		return result;
	}

	public int getCode() {
		return code;
	}

	public void setCode(int code) {
		this.code = code;
	}

	public String getMsg() {
		return msg;
	}

	public void setMsg(String msg) {
		this.msg = msg;
	}
}
